[
    {
        "title": "Orientation Quiz",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Instructions------------You must take the Orientation Quiz and achieve at least 80% in order to begin the weekly course modules. You have three attempts available to earn max of 100% score.Carefully read each question and select the answer option that is most correct. The questions in this test are focused on instructor policies for the course and course navigation. All of the information in the orientation quiz can be found in the syllabus, and course success tips. You are encouraged to be familiar with the information in these documents prior to attempting the Quiz.",
        "due_date": "08/20/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=08&year=2024#assignment_3351059",
        "status": "Submitted"
    },
    {
        "title": "Discussion - Introductions (A student introduction activity is a QM requirement.)",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "We are going to engagein a great deal of collaboration and sharing of ideas throughout this course. Participation in Discussions is a significant part of your final course grade. The purpose of this discussion forum is for you to get to know your class mates! You are not alone in this course, and you will be interacting with each other often.So let's begin our course experience by getting to know one another.Instructions------------Write one paragraph about yourself. Tell us about the school from where you graduated. Fill us in on your work experience. Share your career goal. Reveal one surprising fact about yourself. Fill us in on your hobbies, interests, and activities.*Post an initial response to these questions by the due date. Your post should be at least one paragraph (50-100 words).*Respond to at least two of your peers' posts by adding one significant detail or asking one question to each. Post your responses by the due date.Your discussion posts will be evaluated using the Discussion Rubric.(A sample rubric is attached to this discussion forum using the Canvas rubric tool. Additional examples are located in the Files area.)",
        "due_date": "08/26/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=08&year=2024#assignment_3345524",
        "status": "Not Submitted"
    },
    {
        "title": "Proposal",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapters 1-3 of the text, and examine any relevant resources provided.The proposal document shall clearly describe the planned final project’s end product. This document should contain graphics, images, or tables, which can be produced using various applications. It must be written using complete English sentences and have been spell- and grammar-checked.* Project Proposal(Due 8/29/2021) — must not exceed four pages not including tables, figures or images. It must be single space 12 point New Times Roman. The proposal document shall clearly describe the planned final project’s end product. This document should contain graphics, images, or tables, which can be produced using other applications to clarify your intent. It must be written using complete English sentences and have been spell- and grammar-checked. The document must unambiguously describe what the proposed system will do.The document must include the following topics: working title of project, purpose of the project, platform (e.g., Windows, Mac, iOS), intended customer/user (that is, who the program is for), source of the idea for the project, development environment and/or tools to be used, development language(s), limitations or risks anticipated, schedule (built around the course milestones), estimated number of lines of code, documentation, user training and/or user documentation, and a delivery/installation plan. The document should also include anything not mentioned above that will be relevant or helpful when evaluating the proposal.The Format of the proposal document must include but not limited to the following topics: You must write a narrative not just answer these question. (Answers only will not be accepted and your proposal will be disapproved). You must have a heading for each category and write several paragraphs explaining the response for each item/category listed below.* Working title of project, your name, course title and number and section, instructor name, and date.* purpose of the project, platform (e.g., Windows, Linux, Mac, iOS),* intended customer/user (that is, who the program is for), source of the idea for the project, development tools/ software to be used,* limitations or risks anticipated,* schedule (built around the course milestones),* user training and/or user documentation, and* A delivery/installation plan if any. The document should also include anything not mentioned above that will be relevant or helpful when evaluating the proposal.A typical proposal document will be 3-4 pages in length. Sample outline of the proposal  [Capstone Proposal Sample2.pdf] (https://hcc.instructure.com/courses/142233/files/19400543?wrap=1)Your document should be saved in Microsoft Word format.",
        "due_date": "09/01/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=09&year=2024#assignment_3345530",
        "status": "Submitted"
    },
    {
        "title": "Requirements",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapter 4 of the text, and examine the relevant resources provided.The requirements document shall consist of detailed \"use cases\" describing all functional requirements. Any non-functional requirements (such as performance requirements, e.g., response time to a keypress) must be documented as well in this document. Use cases are often graphical, using UML notation, but that is not required. Here is a sample outline of the requirement[Requirements Document sample2.pdf] (https://hcc.instructure.com/courses/142233/files/19400541?wrap=1) document * Requirements Document(Due 9/19/2021) — Detailed \"use cases\" describing all functional requirements. Any non-functional requirements (such as performance requirements, e.g., response time to a keypress) must be documented as well in this document. Use cases are often graphical using UML notation, but that is not required.A typical requirements document will be 5-8 pages in length. It must be single space 12 point New Times Roman. Your document should be saved in Microsoft Word format. You must have learnt how to gather requirement from the class that you took it which is System Analysis course. Read this document to learn more about requirements [Functional and Technical requirements.pdf] (https://hcc.instructure.com/courses/142233/files/19400514?wrap=1) this is just a sample but you must cover all other aspects of the requirements.A typical requirements document will be 5-8 pages in length.Your document should be saved in Microsoft Word format. See syllabus also",
        "due_date": "09/22/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=09&year=2024#assignment_3345531",
        "status": "Submitted"
    },
    {
        "title": "Test Matrix",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Use the excel spreadsheet provided [Test Matrix - Sample-1.xlsx] (https://hcc.instructure.com/courses/142233/files/19400550?wrap=1) [[Preview the document] (https://hcc.instructure.com/images/preview.png)] (https://hcc.instructure.com/courses/142233/files/19400524/download?wrap=1) to capture all of your system’s requirements as described in the syllabus. Each row of the spreadsheet will contain one of the system’s requirements. Doing this allows you to easily list all of the system’s requirements so that you’ll remember to design and test each one. The Test Matrix, once approved, will be “frozen” and used during the final demonstration to ensure that each requirement has been adequately fulfilled. This means test matrix serves as your project's acceptance test suite. Make sure you include ALL of your requirements in this matrix.Remember that the Test Matrix will be used as a grading tool when you demonstrate your project at the end of the term.For each item in the list, you must clearly describe WHAT the feature or function does and also clearly describe HOW it will be tested or verified (will something be measured? will a file be checked? should something happen within a certain period of time? etc.).Use and submit only the filled-in [Test Matrix - Sample.xlsx] (https://hcc.instructure.com/courses/142233/files/19400553?wrap=1) provided for this assignment. Please note that this is just a sample guidance for you it is not complete you must come up with your tests.",
        "due_date": "09/29/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=09&year=2024#assignment_3345533",
        "status": "Not Submitted"
    },
    {
        "title": "Discussion2",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Discuss how did you like the assignments so far? What challenging you have faced? what would like theinstructorto do to improve students experience.Please note you need to berealisticin your response some of you think theinstructorcan do is notachievablebecause of differentfactors. Alsorememberthat this class is an online class withno meeting scheduled by the college as indicated in the orientationquiz.",
        "due_date": "10/06/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=10&year=2024#assignment_3345522",
        "status": "Not Submitted"
    },
    {
        "title": "Preliminary Design",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapter 5 of the text and examine any relevant resources provided. Sample of the outlines you must come up with your own [Prelim design sample.pdf] (https://hcc.instructure.com/courses/142233/files/19400549?wrap=1)The preliminary design document describe the preliminary or top-level design of the system under development, also known as the system architecture or the high-level design. This is described in the syllabus. Briefly, you will describe the interfaces and interactions of the identified high-level modules or layers of your system. (Class diagrams, sequence diagrams, functional flowcharts, database schema, etc., go in the detailed design document.) While not usually included here, your document for this capstone can also include your initial design expressed in class diagrams, or pseudocode (or flow charts) if not using object-orientated design or implementation.The document shall be saved in Microsoft Word format. It shall include flowcharts, hierarchy charts, pseudocode, class diagrams, and/or any other graphical or tabular features useful for communicating a software system’s overall design (the system architecture) to a reviewer. (UML is encouraged but not required for diagrams.) Remember that the DESIGN of the system relates to its INTERNAL structure and architecture (in other words, the design shows how the program is built internally, as well as the parts that users will see.)A typical preliminary design document will be 10+ pages in length and will contain many diagrams and visual depictions.(Capstone projects are often much smaller than real-world ones and do not need a large high-level design document, especially when using object-oriented design. If you've covered everything needed in 2-5 pages, that's fine too.)",
        "due_date": "10/13/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=10&year=2024#assignment_3345528",
        "status": "Not Submitted"
    },
    {
        "title": "Detailed Design",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapters 6 through 13 (that's about 135 pages!) of the text, and examine any relevant resources provided. See this document for the guidelinesof the detailed requirement.  [Detailed Sample2.pdf] (https://hcc.instructure.com/courses/142233/files/19400544?wrap=1)    See syllabus for details.The detailed design expands the preliminary design document, as described in the syllabus. Briefly, it shall incorporate any revisions or updates from the preliminary design document feedback. It shall also describe the detailed design of the system under development.(Too many students like to code first and design and document later. It is okay to try some coding to help you finalize the design, but that code should then be thrown out.)The document shall be saved in Microsoft Word format.",
        "due_date": "10/27/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=10&year=2024#assignment_3345526",
        "status": "Not Submitted"
    },
    {
        "title": "Unit Test Suite",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapter 16 of the text, and examine any relevant resources provided.See the syllabus for details on this project. Briefly, you will submit a skeleton program, which typically means a set of classes or modules with functions (depends on your programming language) with stub public methods (methods with a correct signature/prototype and return statement, but no implementation at all). The skeleton should include commentsbased on the design. Building a test database (or test data files) is also part of this phase. You will also build a unit test suite as described in the syllabus, using an appropriate testing framework.You will submit a zip file containing your project skeleton and unit tests, and any test resources including files or databases. (The zip often is just the project folder from your development tool, or the top of a Maven or Git project.)It is expected your code will compile and run without error, although none of the tests are expected to pass.Unit Test Suite(Due 10/31/2021) (and code skeleton)—In this phase you translate your design into a skeleton program, which typically means a set of classes or modules with functions (depends on your programming language) withstubpublic methods (methods with a correct signature/prototype and return statement, but no implementation at all).The skeleton should include commentsbased on the design. Building a test database (or test data files) is also part of this phase.You will probably need some simple user interface (for example, a PHP web interface) to be able to examine and update your data. This \"scaffolding\" code is in addition to your actual project code, as is any testing code and deployment scripts. Then build and deliver a unit test suite, based on the design and requirements. You can use any test framework approved by your instructor, but here are recommendations: For Java, use JUnit. For C#, VB, or any .net language, use NUnit. For other languages, find an appropriate testing framework (which you should have your faculty advisor approve).Remember, the purpose of the unit tests is to ensure the implementation properly fulfills the design. You need enough test cases for this. (At this point, none of your tests are expected to pass. You work on making each test pass, one at a time, in the implementation and testing phase.Note for object-oriented, test-drivendevelopment,tests and the detailed design (and the implementation) are all developed at the same time. Your instructor understands that, but for grading purposes you need to submit a test suite before the implementation is done;you are allowed to expand your test suite later.",
        "due_date": "11/03/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=11&year=2024#assignment_3345534",
        "status": "Not Submitted"
    },
    {
        "title": "Case Study and software review",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapter 17 of the text, and examine any relevant resources provided.Before beginning this assignment, please read all the remaining chapters of the text, and examine any relevant resources from the internet.By this date you must either have selected some software for the code review See the syllabus for more details.Upload the software you wish to review for this project's submission and the detailed, professional-quality code review for the case study that you chose. You can upload a PDF, a program source file, a zip of several source files, or a URL to this assignment GitHub repository.Prepare a detailed code review and analysis of the code that you have selected. The syllabus contains the details and requirements for this (see the CASE STUDY section). Be sure to cover, at minimum, each bullet point shown in the syllabus. Your submission must be in Microsoft Word format.The case study involves a detailed, professional-quality code review. Students should take some time to find source code (not written by them) they wish to review. (This is a great opportunity to participate in open source development; you can review some code found on GitHub (or elsewhere), and if you find any improvements, you can submit them as pull-requests.) See syllabus for details.Some sites you can search that host open source projects include: Don’t copy, you must come up with your own lines of codes based on your proposal.* [org(Links to an external site.)] (https://bitbucket.org/)* https://projectworlds.in/",
        "due_date": "11/17/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=11&year=2024#assignment_3345525",
        "status": "Submitted"
    },
    {
        "title": "Project presentation and final report upload _Due November . Week before your actual presentation and demonstration",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Meeting Link to join on Friday Nov 22nd at 10 am to present and demonstrate your term final project will be provided later on. Attendance for all is Mandatory.DR. Mubarak Banisakher is inviting you to a scheduled Zoom meeting.Topic: Final project presentation and demonstration.Time: Nov 24th, 10:00 AM Eastern Time (US and Canada)Join Zoom MeetingInstructionsFor this Link you need only to upload your presentation and final report so I can look at them before the actual presentation and demonstration last week November 22nd.  [Project report_presentation_Demonstration_Instructions_Robric1-1.pdf] (https://hcc.instructure.com/courses/142233/files/19400545?wrap=1)1- You need to present your project through zoom , create a PowerPoint presentation to demonstrate your project in front of the class. Everyone must attend the zoom meeting. You must have camera and mic in your computer.2- You need to upload your final report and PowerPoint presentation to this link . Meaning you will have to upload two files one word document and the second one is the PPT slides .Instructor enters these points based on the demonstration and the success (or failure) of the acceptance tests from your test matrix. Submit your PowerPoint presentation to this link. This assignment is a place-holder so your grade can be entered into Canvas.* Final Project Report, Demo and Presentation (Due 11/22) —the final project shall include these deliverable components: (a) full report with full details including all the previous components that you have submitted combined in one document and organized as:* Cover page, Title of your project, your name, your course title, date.* Table of content* All other component of the project except the code which you supposed to upload it to the assignment drobox.* Conclusion of your findings* References if you took anything from anywhere* Demonstration of your product: an executable computer program, (a) a DEMONSTRATION of that program on the system’s target platform, and (b) a documentation package containing all of the program’s source code as well as the final version of the design documents. (Remember that the Test Matrix will be used as a grading tool during the demo.) It shall also contain user or other technical documentation to accompany the program.Without a demonstration of a substantially working computer program, the best grade possible in the course is a F.The demo is typically via Zoom screen sharing, but other means can be arranged if necessary.* Presentation: The Live presentation of the final project is a must and a demonstration of a substantially working computer program is critical for success in his class is important and a must. It is up to the student to communicate with their faculty advisor if they can’t present on the day assigned and they must provide documentation to show the reason for not be able to attend. They must then communicate with the instructor to schedule another day and time before the advertised due date in the syllabus and canvas of the presentation.",
        "due_date": "11/22/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=11&year=2024#assignment_3345529",
        "status": "Not Submitted"
    },
    {
        "title": "Source Code and Documentation Package ( All of the project component) Zip file.",
        "course": "24/FA-COP-2939-93453 Computer Programming Capstone",
        "description": "Before beginning this assignment, please read chapters 14-15 of the text, and examine any relevant resources provided.You must submit a zip containing ALL of your DOCUMENTED source code as well as ALL of your user documentation (manuals, instruction guide, help files, etc.) as described in the syllabus. If (as is likely) you have updated your unit test suite, include that as well. here is the documents that I sent by email several times about the final report and the presentation. [Project report_presentation_Demonstration_Instructions_Robric1.pdf] (https://hcc.instructure.com/courses/142233/files/19400542?wrap=1)It is expected that your instructor can build your software without error. Due to time constraints, it may be not all feature proposed are implemented, and those unit and acceptance tests will fail. Don't panic about that, as long as you keep your instructor informed of your progress, the test matrix (acceptance tests) can be adjusted.Be sure to include any additional resources required, such as graphics or a database. See the syllabus for more details on this project.You need to upload your final source code and user manual ( User manual must include step by step instruction of how to run your product) . Meaning you will have to upload two files one word document and the second one is the code for example .java , .cpp...etc .",
        "due_date": "11/22/2024",
        "url": "https://hcc.instructure.com/calendar?include_contexts=course_142233&month=11&year=2024#assignment_3345532",
        "status": "Not Submitted"
    }
]